cavisson/default/default/services/getBalance/service_getBalanceRequest.req

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><urn:MessageHeader xmlns:urn="urn:kohls:xml:schemas:message-header:pci:v1_0" soapenv:mustUnderstand="0" /></soapenv:Header><soapenv:Body><pci:getBalanceRequest xmlns:pci="http://pci.kohls.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><pci:channel>WEB</pci:channel><pci:debug>true</pci:debug><pci:store><storeNumber>0873</storeNumber></pci:store><pci:transactions><pci:transaction><pci:transactionId>300002</pci:transactionId><pci:provider>AJB</pci:provider><pci:cardType>GiftCard</pci:cardType><pci:transactionType>BalanceInquiry</pci:transactionType><pci:amount>0.00</pci:amount><pci:token><provider>protegrity</provider><cardToken>426183722004019620435</cardToken></pci:token><pci:providerSpecific><pci:ajb><posReferenceNo xsi:nil="true" /><invoice xsi:nil="true" /><pinBlock>9787</pinBlock></pci:ajb></pci:providerSpecific></pci:transaction></pci:transactions></pci:getBalanceRequest></soapenv:Body></soapenv:Envelope>
